In [1]:
# pip install pandas

In [2]:
import pandas as pd

In [3]:
# Video 18 done

In [4]:
# PANDAS SERIES

In [5]:
pd.__version__ # check version

'1.2.4'

In [6]:
list_s = [1,2, -3, 6.2,'data values']
print(list_s)

[1, 2, -3, 6.2, 'data values']

In [7]:
series1 = pd.Series(list_s) # create series
print(series1)

0              1
1              2
2             -3
3            6.2
4    data values
dtype: object

In [8]:
type(series1) # check type

pandas.core.series.Series

In [9]:
series2 = pd.Series([1,2,3,4]) # create series on short way
print(series2)

0    1
1    2
2    3
3    4
dtype: int64

In [10]:
empty_s = pd.Series([]) # create empty series
print(empty_s)

Series([], dtype: float64)

<ipython-input-10-22accf230ce3>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  empty_s = pd.Series([]) # create empty series

In [11]:
series3 = pd.Series([1,2,3,4], index=['a','b','c','d']) # create series on short way with custom index. valu and index allwage should be equel
print(series3)

a    1
b    2
c    3
d    4
dtype: int64

In [12]:
series3 = pd.Series([1,2,3,4], index=['a','b','c','d'],dtype= float) # create series on short way with custom index. valu and index allwage should be equel
print(series3)

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [13]:
series3 = pd.Series([1,2,3,4], index=['a','b','c','d'],dtype= float,name = 'data values') # create series on short way with custom index. valu and index allwage should be equel
print(series3)

a    1.0
b    2.0
c    3.0
d    4.0
Name: data values, dtype: float64

In [14]:
scalear_s = pd.Series(0.5)
print(scalear_s)

0    0.5
dtype: float64

In [15]:
scalear_s = pd.Series(0.5, index=[1,2,3])
print(scalear_s)

1    0.5
2    0.5
3    0.5
dtype: float64

In [16]:
dict_s = pd.Series({'a' : 1, 'b': 2})
print(dict_s)

a    1
b    2
dtype: int64

In [17]:
s4 = pd.Series([1,2,3,4,5])
print(s4)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [18]:
s4[0]

1

In [19]:
s4[3]

4

In [20]:
s4[0:3] # sliceing

0    1
1    2
2    3
dtype: int64

In [21]:
max(s4) # findoout max valu

5

In [22]:
min(s4) # find out min valu

1

In [23]:
s4[ s4 > 3 ] # find valu getter then 3

3    4
4    5
dtype: int64

In [24]:
s4

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [25]:
s5 = pd.Series([1,2,3,4,5])
print(s5)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [26]:
print(s4)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [27]:
s4 + s5

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [28]:
s6 = pd.Series([1,2,3])
print(s6)

0    1
1    2
2    3
dtype: int64

In [29]:
s5 + s6

0    2.0
1    4.0
2    6.0
3    NaN
4    NaN
dtype: float64

In [30]:
# VIDEO 19 DONE

In [31]:
# PANDAS DATAFRAME

In [32]:
emt_df = pd.DataFrame() # Create empty dataframe
print(emt_df)

Empty DataFrame
Columns: []
Index: []

In [33]:
lst = ['a','b','c'] # Create list
print(lst)

['a', 'b', 'c']

In [34]:
df1 = pd.DataFrame(lst) # Create dataFrame from list
print(df1)

   0
0  a
1  b
2  c

In [35]:
df1

   0
0  a
1  b
2  c

In [36]:
ls_of_ls = [ [1,2,3],[2,3,4],[4,5,6] ]
print(ls_of_ls)

[[1, 2, 3], [2, 3, 4], [4, 5, 6]]

In [37]:
df2 = pd.DataFrame(ls_of_ls)
df2

   0  1  2
0  1  2  3
1  2  3  4
2  4  5  6

In [38]:
dict1 = {'ID' : [11,22,33,44]}
dict1

{'ID': [11, 22, 33, 44]}

In [39]:
df3 = pd.DataFrame(dict1) # create data frame use dicnarry
df3

   ID
0  11
1  22
2  33
3  44

In [40]:
dict1 = {'ID' : [11,22,33,44], 'SA' : [1,2,3,4]}
dict1

{'ID': [11, 22, 33, 44], 'SA': [1, 2, 3, 4]}

In [41]:
df3 = pd.DataFrame(dict1)
df3

   ID  SA
0  11   1
1  22   2
2  33   3
3  44   4

In [42]:
ls_dict = [{'a' : 1, 'b' : 2}, {'a': 3,'b': 4}]
ls_dict

[{'a': 1, 'b': 2}, {'a': 3, 'b': 4}]

In [43]:
df5 = pd.DataFrame(ls_dict)
df5

   a  b
0  1  2
1  3  4

In [44]:
ls_dict = [{'a' : 1, 'b' : 2}, {'a': 3,'b': 4, 'c' : 5}]
df5 = pd.DataFrame(ls_dict)
df5

   a  b    c
0  1  2  NaN
1  3  4  5.0

In [45]:
dict_sr = {'id' : pd.Series([1,2,3]), 'sa' : pd.Series([111,222,333])} # Create dataframe use dic of Series
df6 = pd.DataFrame(dict_sr)
df6

   id   sa
0   1  111
1   2  222
2   3  333

In [46]:
# VIDEO 20 DONE

In [47]:
# HOW TO READ CSV FILE IN PANDAS

In [48]:
pd.read_csv('Student_1.csv')

,Student ID,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,4,0,80
2,1003,10,3,8,4,4,60
3,1004,11,0,10,1,5,45
4,1005,11,4,7,2,0,75
5,1006,11,10,7,0,0,96
6,1007,12,4,6,0,0,80
7,1008,12,10,6,2,0,90
8,1009,12,2,8,2,4,60
9,1010,12,6,9,1,0,85

In [49]:
pd.read_csv('Top_10_it.csv')

  Top 10 IT Companies in india
0                          TCS
1                      Infosys
2                Tech Mahindra
3                        Wipro
4             HCL Technologies
5                 L&T Infotech
6                     Mindtree
7                      Mphasis
8    Oracle Financial Services
9                  Rotla India

In [50]:
import os

In [51]:
print(os.getcwd()) # to show our working dic

i:\All Gide Bank\ARTIFICIAL_INTELLIGENCE_Gide_Bank\MACHINE_LEARNING_GIDE_BANK\PANDAS

In [52]:
# VIDEO 21 DONE

In [53]:
# HOW TO WRITE CSV FILE IN PANDAS

In [54]:
df = pd.read_csv('Fortune_10.csv')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [55]:
type(df) # to chack type

pandas.core.frame.DataFrame

In [56]:
df.columns # print colum name

Index(['ID', 'Name', 'Industry', 'Inception', 'Revenue', 'Expenses', 'Profit',
       'Growth'],
      dtype='object')

In [57]:
df = pd.read_csv('Fortune_10.csv', nrows= 1 ) # print spacipic row
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%

In [58]:
df = pd.read_csv('Fortune_10.csv', nrows= 5 ) # print 5 row
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%

In [59]:
df = pd.read_csv('Fortune_10.csv', usecols= [0] ) # print spacipic col / valu will be on list
df

   ID
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [60]:
df = pd.read_csv('Fortune_10.csv', usecols= [0,1] ) # print spacipic col / valu will be on list
df

   ID             Name
0   1          Lamtone
1   2        Stripfind
2   3  Canecorporation
3   4         Mattouch
4   5        Techdrill
5   6         Techline
6   7          Cityace
7   8   Kayelectronics
8   9          Ganzlax
9  10      Trantraxlax

In [61]:
df = pd.read_csv('Fortune_10.csv', usecols= [2,4,7] ) # print importent col / valu will be on list
df

              Industry       Revenue Growth
0          IT Services  $11,757,018     30%
1   Financial Services  $11,757,018     20%
2               Health  $11,757,018      7%
3          IT Services  $11,757,018     26%
4               Health  $11,757,018      8%
5               Health  $11,757,018     23%
6               Health  $11,757,018      6%
7               Health  $11,757,018      4%
8          IT Services  $11,757,018     18%
9  Government Services  $11,757,018      7%

In [62]:
df = pd.read_csv('Fortune_11.csv') # on this file first row is heading
df

,0,1,2,3,4,5,6,7
0,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
1,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
2,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
3,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
4,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
5,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
6,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
7,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
8,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
9,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
10,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [63]:
df = pd.read_csv('Fortune_11.csv',skiprows= 1) # to skip 1st row
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [64]:
df = pd.read_csv('Fortune_11.csv',skiprows= 2) # to skip 2 row
df

,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
0,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
1,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
2,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
3,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
4,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
5,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
6,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
7,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
8,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [65]:
df = pd.read_csv('Fortune_11.csv',skiprows= [0])  # skip use index
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [66]:
df = pd.read_csv('Fortune_11.csv',skiprows= [2])  # skip use index
df

,0,1,2,3,4,5,6,7
0,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [67]:
df = pd.read_csv('Fortune_11.csv',skiprows= [1,2,3])  # skip multi row use index
df

,0,1,2,3,4,5,6,7
0,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
1,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
2,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
3,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
4,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
5,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
6,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
7,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [68]:
df = pd.read_csv('Fortune_10.csv')  
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [69]:
df = pd.read_csv('Fortune_10.csv',index_col='ID')   # chenge index
df

,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
ID,,,,,,,
1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [70]:
df = pd.read_csv('Fortune_10.csv',index_col='Name')   # make name into index
df

,ID,Industry,Inception,Revenue,Expenses,Profit,Growth
Name,,,,,,,
Lamtone,1,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
Stripfind,2,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
Canecorporation,3,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
Mattouch,4,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
Techdrill,5,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
Techline,6,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
Cityace,7,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
Kayelectronics,8,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
Ganzlax,9,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
Trantraxlax,10,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [71]:
df = pd.read_csv('Fortune_10.csv',index_col= 2)   # chenge index in industy
df

,ID,Name,Inception,Revenue,Expenses,Profit,Growth
Industry,,,,,,,
IT Services,1,Lamtone,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
Financial Services,2,Stripfind,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
Health,3,Canecorporation,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
IT Services,4,Mattouch,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
Health,5,Techdrill,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
Health,6,Techline,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
Health,7,Cityace,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
Health,8,Kayelectronics,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
IT Services,9,Ganzlax,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
Government Services,10,Trantraxlax,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [72]:
# VIDEO 22 DONE

In [73]:
# HOW TO WRITE CSV FILE

In [74]:
pd.read_csv('Fortune_11.csv', )

,0,1,2,3,4,5,6,7
0,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
1,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
2,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
3,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
4,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
5,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
6,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
7,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
8,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
9,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
10,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [75]:
pd.read_csv('Fortune_11.csv', header=1) # make 1 index to header

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [76]:
pd.read_csv('Fortune_12.csv', ) # colam will show unnamed becouse col name is not set

,Unnamed: 0,Data,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
1,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
2,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
3,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
4,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
5,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
6,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
7,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
8,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
9,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
10,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [77]:
pd.read_csv('Fortune_12.csv', header=1)

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [78]:
pd.read_csv('Fortune_13.csv') #  There is no header on this file

,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
0,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
1,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
2,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
3,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
4,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
5,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
6,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
7,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
8,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [79]:
pd.read_csv('Fortune_13.csv', header= None) # if header is not avable avable than use header is none

,0,1,2,3,4,5,6,7
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [80]:
pd.read_csv('Fortune_13.csv', header= None, prefix= 'Columns') # make custop header

,Columns0,Columns1,Columns2,Columns3,Columns4,Columns5,Columns6,Columns7
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [81]:
pd.read_csv('Fortune_13.csv', names=['A','B','C','D','E','F','G','H']) # make custom heading for every colom

,A,B,C,D,E,F,G,H
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [82]:
pd.read_csv('Fortune_13.csv', names=['ID','Name','Industry','Inception','Revenue','Expenses','Profit','Growth']) # make custom heading for every colom

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [83]:
# VIDEO 23 DONE

In [84]:
# HOW TO WRITE CSV FILE IN PANDAS

In [85]:
df = pd.read_csv('Fortune_10.csv')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [86]:
df.head() # print first 5 row

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%

In [87]:
df.head(1) # frint only 1 row

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%

In [88]:
df.head(8) # frint only 8 row

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%

In [89]:
df.tail() # print 5 row from bottom

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [90]:
df.tail(2) # print 2 row from bottom

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [91]:
df.tail(7) # print 7 row from bottom

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [92]:
df = pd.read_csv('Fortune_10.csv', dtype= {'ID': 'float64'}) # change first ID colum from int to str
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2.0,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3.0,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4.0,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5.0,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6.0,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7.0,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8.0,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9.0,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10.0,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [93]:
df = pd.read_csv('Fortune_10.csv', dtype= {'ID': 'float64','Profit' : 'float64'}) # change first ID & Profit colum from int to str
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553.0,30%
1,2.0,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553.0,20%
2,3.0,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553.0,7%
3,4.0,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553.0,26%
4,5.0,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553.0,8%
5,6.0,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553.0,23%
6,7.0,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553.0,6%
7,8.0,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553.0,4%
8,9.0,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553.0,18%
9,10.0,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553.0,7%

In [94]:
df = pd.read_csv('Fortune_14.csv') 
df

,ID,Date No,Date Yes,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,No,Yes,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,No,Yes,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,No,Yes,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,No,Yes,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,No,Yes,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,No,Yes,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,No,Yes,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,No,Yes,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,No,Yes,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,No,Yes,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [95]:
df = pd.read_csv('Fortune_14.csv',true_values=['Yes'])  # where is yes there is true
df

,ID,Date No,Date Yes,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,No,True,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,No,True,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,No,True,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,No,True,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,No,True,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,No,True,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,No,True,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,No,True,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,No,True,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,No,True,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [96]:
df = pd.read_csv('Fortune_14.csv')
df

,ID,Date No,Date Yes,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,No,Yes,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,No,Yes,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,No,Yes,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,No,Yes,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,No,Yes,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,No,Yes,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,No,Yes,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,No,Yes,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,No,Yes,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,No,Yes,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [97]:
df = pd.read_csv('Fortune_14.csv',true_values=['Yes'], false_values= ['No'])  # where is yes there is true and where is No there is false
df

,ID,Date No,Date Yes,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,False,True,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,False,True,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,False,True,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,False,True,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,False,True,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,False,True,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,False,True,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,False,True,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,False,True,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,False,True,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [98]:
# VIDEO 24 DONE

In [99]:
# HANDLING MISSING VALUES

In [100]:
#     NaN = #N/A, #N/A N/A, #NA, -1.#IND, -1.#QNAN, -NnN, -nan, N/A, NA, NULL, null, n/a, nan, 1.#IND, 1.#QNAN

In [101]:
df = pd.read_csv('Fortune_15.csv')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [102]:
df = pd.read_csv('Fortune_15.csv', na_values= 'not available') # not avable avable will be NaN
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,NaN
4,5,yyy,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,NaN
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [103]:
df = pd.read_csv('Fortune_15.csv')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [104]:
df = pd.read_csv('Fortune_15.csv', na_values= ['not available','yyy']) # not avable avable & yyy will be NaN
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,NaN
4,5,NaN,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,NaN
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,NaN,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [105]:
df = pd.read_csv('Fortune_15.csv')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [106]:
df = pd.read_csv('Fortune_15.csv',na_values={'Growth':'not available'}) # make custom nan valu use colum
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,NaN
4,5,yyy,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,NaN
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [107]:
df = pd.read_csv('Fortune_15.csv')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [108]:
df = pd.read_csv('Fortune_15.csv',keep_default_na=False) # keep default valu do not show NaN
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,,2006,"$11,757,018","6,482,465 Dollars",5274553,
6,7,Cityace,,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [109]:
df = pd.read_csv('Fortune_10.csv')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [110]:
df = pd.read_csv('Fortune_10.csv',na_filter=False) # it will not check messing valu or null valu tha's wht speed will boost
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [111]:
# VIDEO 25 DONE

In [112]:
# HANDLING MISSING VALUES

In [113]:
df = pd.read_csv('Fortune_15.csv')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [114]:
df.isnull() # to chack null valu

      ID   Name  Industry  Inception  Revenue  Expenses  Profit  Growth
0  False  False     False      False    False     False   False   False
1  False  False     False      False    False     False   False   False
2  False  False     False      False    False     False   False   False
3  False  False     False      False    False     False   False   False
4  False  False      True      False    False     False   False   False
5  False  False      True      False    False     False   False    True
6  False  False      True      False    False     False   False   False
7  False  False      True      False    False     False   False   False
8  False  False     False      False    False     False   False   False
9  False  False     False      False    False     False   False   False

In [115]:
df.isnull().sum() # to show null valu use col

ID           0
Name         0
Industry     4
Inception    0
Revenue      0
Expenses     0
Profit       0
Growth       1
dtype: int64

In [116]:
df.isnull().sum().sum() # To show total null valu

5

In [117]:
df.notnull()

     ID  Name  Industry  Inception  Revenue  Expenses  Profit  Growth
0  True  True      True       True     True      True    True    True
1  True  True      True       True     True      True    True    True
2  True  True      True       True     True      True    True    True
3  True  True      True       True     True      True    True    True
4  True  True     False       True     True      True    True    True
5  True  True     False       True     True      True    True   False
6  True  True     False       True     True      True    True    True
7  True  True     False       True     True      True    True    True
8  True  True      True       True     True      True    True    True
9  True  True      True       True     True      True    True    True

In [118]:
df.notnull().sum()

ID           10
Name         10
Industry      6
Inception    10
Revenue      10
Expenses     10
Profit       10
Growth        9
dtype: int64

In [119]:
df.notnull().sum().sum() # Total 75 valu is not null

75

In [120]:
# SERIES

In [121]:
import numpy as np
sr = pd.Series([1,2,3,np.nan,4,np.NAN]) # np.nan,np.NAN = NaN
sr

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    NaN
dtype: float64

In [122]:
sr.isnull()

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [123]:
sr.isnull().sum()

2

In [124]:
# VIDEO 26 DONE

In [125]:
# HANDLING MISSING VALUES

In [126]:
df = pd.read_csv('Fortune_15.csv')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [127]:
df.dropna() # delete the row which have null valu

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [128]:
df.dropna(axis= 1) # delete the col which have null valu

   ID             Name  Inception       Revenue           Expenses   Profit
0   1          Lamtone       2009  $11,757,018   6,482,465 Dollars  5274553
1   2        Stripfind       2010  $11,757,018   6,482,465 Dollars  5274553
2   3  Canecorporation       2012  $11,757,018   6,482,465 Dollars  5274553
3   4         Mattouch       2013  $11,757,018   6,482,465 Dollars  5274553
4   5              yyy       2009  $11,757,018   6,482,465 Dollars  5274553
5   6         Techline       2006  $11,757,018   6,482,465 Dollars  5274553
6   7          Cityace       2010  $11,757,018   6,482,465 Dollars  5274553
7   8   Kayelectronics       2009  $11,757,018   6,482,465 Dollars  5274553
8   9          Ganzlax       2011  $11,757,018   6,482,465 Dollars  5274553
9  10              yyy       2011  $11,757,018   6,482,465 Dollars  5274553

In [129]:
df.dropna(how='any') # delete the row which has null valu

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [130]:
df.dropna(how='any',axis=1) # delete the col which has null valu

   ID             Name  Inception       Revenue           Expenses   Profit
0   1          Lamtone       2009  $11,757,018   6,482,465 Dollars  5274553
1   2        Stripfind       2010  $11,757,018   6,482,465 Dollars  5274553
2   3  Canecorporation       2012  $11,757,018   6,482,465 Dollars  5274553
3   4         Mattouch       2013  $11,757,018   6,482,465 Dollars  5274553
4   5              yyy       2009  $11,757,018   6,482,465 Dollars  5274553
5   6         Techline       2006  $11,757,018   6,482,465 Dollars  5274553
6   7          Cityace       2010  $11,757,018   6,482,465 Dollars  5274553
7   8   Kayelectronics       2009  $11,757,018   6,482,465 Dollars  5274553
8   9          Ganzlax       2011  $11,757,018   6,482,465 Dollars  5274553
9  10              yyy       2011  $11,757,018   6,482,465 Dollars  5274553

In [131]:
df.dropna(how='all') # if every row is nan than it will delete the row

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [132]:
df.dropna(thresh= 1) # Print those row whis has minimum 1 not null(true) valu

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [133]:
df.dropna(subset=['Industry']) # delete the row from industry col whics has null valu

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [134]:
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [135]:
df.dropna(inplace=True) # delete the row whics have null valu but it is not create a nuw dataFrame it is updateing the exdastaing  data Frame
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [136]:
# Video 27 done

In [137]:
# WHAT IS PANDAS FILLNA ? fillina fills the NaN values with given values(input)

In [138]:
df = pd.read_csv('Fortune_15.csv') # on missing valu show NaN
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [139]:
df.fillna(0) # where is NaN thare is 0

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,0,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,0,2006,"$11,757,018","6,482,465 Dollars",5274553,0
6,7,Cityace,0,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,0,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [140]:
df.fillna(2)

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,2,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,2,2006,"$11,757,018","6,482,465 Dollars",5274553,2
6,7,Cityace,2,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,2,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [141]:
df.fillna({'Industry' : 'none', 'Growth' : '0'}) # colame wige nan valu change

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,none,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,none,2006,"$11,757,018","6,482,465 Dollars",5274553,0
6,7,Cityace,none,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,none,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [142]:
df.fillna(method='ffill')  # ffill means feveus fill, where is nan valu there is feveus valu

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,IT Services,2006,"$11,757,018","6,482,465 Dollars",5274553,8%
6,7,Cityace,IT Services,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [143]:
df.fillna(method='pad') # ffill means feveus fill, where is nan valu there is feveus valu

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,IT Services,2006,"$11,757,018","6,482,465 Dollars",5274553,8%
6,7,Cityace,IT Services,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [144]:
df.fillna(method='bfill') # bfill means backward fill, it will fill nan valu from backward valu

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,IT Services,2006,"$11,757,018","6,482,465 Dollars",5274553,6%
6,7,Cityace,IT Services,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [145]:
df.fillna(axis= 0, method='ffill')

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,IT Services,2006,"$11,757,018","6,482,465 Dollars",5274553,8%
6,7,Cityace,IT Services,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [146]:
df.fillna(axis= 1, method='ffill')

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,yyy,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Techline,2006,"$11,757,018","6,482,465 Dollars",5274553,5274553
6,7,Cityace,Cityace,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Kayelectronics,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [147]:
df.fillna(axis= 1, method='bfill')

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,2009,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,2006,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,2010,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,2009,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [148]:
df.fillna(0,limit = 1) # fill one 1 nan valu to 0

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,0,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,0
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [149]:
df.fillna(0,limit = 2) # fill one 1 nan valu to 2

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,0,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,0,2006,"$11,757,018","6,482,465 Dollars",5274553,0
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [150]:
df.fillna(method='ffill',limit = 2)

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,IT Services,2006,"$11,757,018","6,482,465 Dollars",5274553,8%
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [151]:
df.fillna(5, inplace=True) # do not make a new dataframe
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,5,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,5,2006,"$11,757,018","6,482,465 Dollars",5274553,5
6,7,Cityace,5,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,5,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [152]:
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,5,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,5,2006,"$11,757,018","6,482,465 Dollars",5274553,5
6,7,Cityace,5,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,5,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [153]:
# video 28 done

In [242]:
# PANDAS REPLACE()
# Syntax : DataFrame.replace()

#'''
#Parameters : 
#to_replace
#limit
#value
#regex
#inplace
#method
#'''

In [155]:
df = pd.read_csv('Fortune_10.csv')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [156]:
df.replace(to_replace='Health', value='Finace') # where is health there is finace

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Finace,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Finace,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Finace,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Finace,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Finace,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [157]:
df.replace('Health', 'Finace') # where is health there is finace use sotcut

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Finace,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Finace,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Finace,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Finace,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Finace,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [158]:
df.replace(10,15) # wher is 10 there is 15

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,15,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [159]:
df.replace([1,2,3,4,5,6,7,8,9,10], 0)

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,0,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,0,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,0,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,0,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,0,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,0,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,0,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,0,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,0,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,0,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [160]:
df.replace([1,2,3,4,5,6,7,8,9,10], [11,22,33,44,55,66,77,88,99,100])

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,11,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,22,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,33,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,44,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,55,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,66,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,77,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,88,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,99,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,100,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [161]:
df.replace({'Industry' : 'Health'}, 'None') # where is health there will be none on industry col

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,None,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,None,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,None,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,None,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,None,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [162]:
df.replace('[A-Z a-z]', 0) # NOTHING WILL HAPPAND

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [163]:
df.replace('[A-Z a-z]', 0,regex= True) # every string valu change to 0

   ID  Name  Industry  Inception  Revenue  Expenses   Profit Growth
0   1     0         0       2009        0         0  5274553    30%
1   2     0         0       2010        0         0  5274553    20%
2   3     0         0       2012        0         0  5274553     7%
3   4     0         0       2013        0         0  5274553    26%
4   5     0         0       2009        0         0  5274553     8%
5   6     0         0       2006        0         0  5274553    23%
6   7     0         0       2010        0         0  5274553     6%
7   8     0         0       2009        0         0  5274553     4%
8   9     0         0       2011        0         0  5274553    18%
9  10     0         0       2011        0         0  5274553     7%

In [164]:
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [165]:
df.replace({'Industry' : '[A-Za-z]'}, 0 , regex= True)

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,0,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,0,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,0,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,0,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,0,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,0,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,0,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,0,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,0,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,0,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [166]:
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [167]:
df.replace('Health',method='ffill') # where is health there will fill by foraword valu

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Financial Services,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,IT Services,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,IT Services,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [168]:
df.replace('Health',method='bfill') # where is health there will fill by backward valu

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,IT Services,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,IT Services,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,IT Services,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [169]:
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [170]:
df.replace('Health',method= 'bfill',limit= 2)

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,IT Services,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,IT Services,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [171]:
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [172]:
df.replace('Health', 100,inplace= True) # do not make new data frame

In [173]:
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,100,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,100,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,100,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,100,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,100,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [174]:
#Video 29 done

In [175]:
# Pandas interpolate()

In [241]:
#'''
#Syntax : DataFrame.interpolate()
#Series.interpolate()


#Parameters : method inplace
#axis limit_direction
#limit limit_area

#'''

In [177]:
df = pd.read_csv('Student_2.csv')
df

,Date,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1/7/2019,10,2.0,9.0,3,5,50.0
1,2/7/2019,10,6.0,NaN,4,0,NaN
2,3/7/2019,10,3.0,8.0,4,4,NaN
3,4/7/2019,11,NaN,10.0,1,5,NaN
4,5/7/2019,11,4.0,7.0,2,0,75.0
5,6/7/2019,11,NaN,7.0,0,0,96.0
6,7/7/2019,12,4.0,NaN,0,0,80.0
7,8/7/2019,12,10.0,6.0,2,0,90.0
8,9/7/2019,12,2.0,8.0,2,4,60.0
9,10/7/2019,12,6.0,9.0,1,0,85.0

In [178]:
df.interpolate() # it will try to gras the number and fill the nan valu only newmaric valu

,Date,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1/7/2019,10,2.0,9.0,3,5,50.00
1,2/7/2019,10,6.0,8.5,4,0,56.25
2,3/7/2019,10,3.0,8.0,4,4,62.50
3,4/7/2019,11,3.5,10.0,1,5,68.75
4,5/7/2019,11,4.0,7.0,2,0,75.00
5,6/7/2019,11,4.0,7.0,0,0,96.00
6,7/7/2019,12,4.0,6.5,0,0,80.00
7,8/7/2019,12,10.0,6.0,2,0,90.00
8,9/7/2019,12,2.0,8.0,2,4,60.00
9,10/7/2019,12,6.0,9.0,1,0,85.00

In [179]:
df.interpolate(method= 'linear') # linear is the defolt valu

,Date,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1/7/2019,10,2.0,9.0,3,5,50.00
1,2/7/2019,10,6.0,8.5,4,0,56.25
2,3/7/2019,10,3.0,8.0,4,4,62.50
3,4/7/2019,11,3.5,10.0,1,5,68.75
4,5/7/2019,11,4.0,7.0,2,0,75.00
5,6/7/2019,11,4.0,7.0,0,0,96.00
6,7/7/2019,12,4.0,6.5,0,0,80.00
7,8/7/2019,12,10.0,6.0,2,0,90.00
8,9/7/2019,12,2.0,8.0,2,4,60.00
9,10/7/2019,12,6.0,9.0,1,0,85.00

In [240]:
#df.interpolate(method= 'time') # it will show the error

In [ ]:
type(df.Date[0])

In [ ]:
df = pd.read_csv('Student_2.csv', parse_dates= ['Date'])
df

In [ ]:
type(df.Date[0])

In [ ]:
df = pd.read_csv('Student_2.csv', parse_dates= ['Date'], index_col= 'Date')
df

In [ ]:
df.interpolate(method='time') # now error will not show //// gess the nan valu use the time

In [ ]:
df.interpolate(method='index') # fill the nan valu use index our index valu is Date

In [ ]:
df = pd.read_csv('Student_2.csv', parse_dates= ['Date'], index_col= 'Class')
df

In [ ]:
df.interpolate(method='index') # fill the nan valu use index our index valu is Class

In [ ]:
df.interpolate(method='nearest') # fill the nan valu use nearest

In [ ]:
df = pd.read_csv('Student_2.csv', parse_dates= ['Date'], index_col= 'Date')
df

In [ ]:
df.interpolate(method='polynomial', order = 1)

In [ ]:
df.interpolate(method='polynomial', order = 2)

In [ ]:
df.interpolate(method='spline', order = 2)

In [ ]:
# VIDEO 30 DONE

In [ ]:
df

In [ ]:
df.interpolate() # fill missing valu defolt liniarly

In [ ]:
df.dtypes

In [ ]:
df.interpolate(limit= 1) # fill only 1 nan valu

In [ ]:
df.interpolate(limit= 2) # fill only 2 nan valu

In [ ]:
df

In [ ]:
df.interpolate(limit = 1, limit_direction= 'backward') # fill the valu fro backward

In [ ]:
df.interpolate(limit = 1, limit_direction= 'both') # fill 1 valu from forward and fill 1 valu from backward becouse of both

In [ ]:
df

In [ ]:
df.interpolate(limit_area= 'inside')

In [ ]:
df.interpolate(limit_area= 'outside')

In [ ]:
df

In [ ]:
df.interpolate(inplace= True) # do not create new data Frame
df

In [ ]:
df

In [ ]:
# VIDEO 31 DONE

In [ ]:
# Pandas Loc
# Syntax : DataFrame.loc[]

In [ ]:
df = pd.read_csv('Student_1.csv')
df

In [ ]:
df.loc[0] # Print The 0 level of all row with col name

In [ ]:
df.loc[9] # Print The 9 level of all row with col name

In [ ]:
df.loc[[0,1]]

In [ ]:
df.loc[[2,4]]

In [ ]:
df

In [ ]:
df.loc[4,'Class'] # print 4th item of Class col

In [ ]:
df.loc[0:3, 'Class']

In [ ]:
df.loc[0:3, 'Percantege']

In [ ]:
#df.loc[[False, False, True]]

In [ ]:
df

In [ ]:
df.loc[df['Class'] < 11 ]

In [ ]:
df.loc[df['Class'] < 11, ['Percantege'] ]

In [ ]:
# PANDAS I LOC
# Syntax : DataFrame.iloc[]

In [ ]:
df.iloc[0]

In [ ]:
df.iloc[[0]]

In [ ]:
df.iloc[:,0] # all row of 1st col

In [ ]:
# df.loc[:,0] # all row of 1st col /// if i use only loc it will show error

In [ ]:
df.iloc[[0,1]]

In [ ]:
# VIDEO 32 DONE

In [ ]:
# Pandas Groupby
# Syntax : DataFrame.groupby()

In [ ]:
df = pd.read_csv('Student_1.csv')
df

In [ ]:
gr1 = df.groupby(by = 'Class')
gr1

In [ ]:
gr1.groups

In [ ]:
gr1 = df.groupby(['Social Media', 'Class']).groups
gr1

In [ ]:
for Section, df_1 in gr1:
    print(Section)
    print(df_1)

In [ ]:
list(gr1)

In [ ]:
dict(gr1)

In [ ]:
df

In [ ]:
df.groupby('Class').get_group(10)

In [ ]:
df.groupby('Social Media').get_group(2)

In [ ]:
gr1

In [ ]:
# Video 33 done

In [ ]:
# Pandas Merging

In [ ]:
df1 = pd.DataFrame({'ID' : [1,2,3,4], 'Class' : [9,10,11,12]})
df1

In [ ]:
df2 = pd.DataFrame({'ID' : [1,2,3,4], 'Name' : ['A','B','C','D']})
df2

In [ ]:
pd.merge(df1, df2, on = 'ID') # ID WILL COMMON ON BOTH DATA FRAME

In [ ]:
pd.merge(df2, df1, on = 'ID')

In [ ]:
df1

In [ ]:
df2 = pd.DataFrame({'ID' : [1,2,3,5], 'Name' : ['A','B','C','D']}) # ID IS NOT SAME
df2

In [ ]:
pd.merge(df1, df2, on = 'ID')

In [ ]:
pd.merge(df1, df2, on = 'ID', how='inner') # defolt how = 'inner'

In [ ]:
pd.merge(df1, df2, on = 'ID', how='left') # output from left data frame i mean df1

In [ ]:
pd.merge(df1, df2, on = 'ID', how='right')

In [ ]:
df1

In [ ]:
df2

In [ ]:
pd.merge(df1, df2, on = 'ID', how='outer') # for print every valu

In [ ]:
pd.merge(df1, df2, on = 'ID', how='outer', indicator= True)

In [ ]:
df1

In [ ]:
df2

In [ ]:
df2 = pd.DataFrame({'ID' : [5,6,7,8], 'Name' : ['A','B','C','D']}) # ID IS NOT SAME
df2

In [ ]:
pd.merge(df1,df2,left_index= True, right_index= True)

In [ ]:
df1 = pd.DataFrame({'ID' : [1,2,3,4], 'Class' : [9,10,11,12]})
df1

In [ ]:
df3 = pd.DataFrame({'ID' : [1,2,3,4], 'Class' : [9,10,11,12]})
df3

In [ ]:
pd.merge(df1,df3, on = 'ID') # BOTH DATA IS SAME

In [ ]:
pd.merge(df1,df3, on = 'ID', suffixes= ('_Higher', '_Middle'))

In [ ]:
# Video 34 done

In [ ]:
# Pandas Concat

In [ ]:
'''
pd.concat()
Parameters : 

obj 
axis
join
join_axes
ignore_index
keys
sort

'''

In [ ]:
sr1 = pd.Series([0,1,2])
sr1

In [ ]:
sr2 = pd.Series([3,4,5])
sr2

In [ ]:
pd.concat([sr1,sr2])

In [ ]:
sr2 = pd.Series([3,4,5,6,7])
sr2

In [ ]:
pd.concat([sr1,sr2])

In [ ]:
df1 = pd.DataFrame({
    'ID' : [1,2,3,4],
    'Name' : ['A','B','C','D'],
    'Class' : [5,6,7,8]
    })

df1

In [ ]:
df2 = pd.DataFrame({
    'ID' : [5,6,7,8],
    'Name' : ['E','F','G','H'],
    'Class' : [9,10,11,12]
    })

df2

In [ ]:
pd.concat([df1,df2])

In [ ]:
pd.concat([df2,df1])

In [ ]:
pd.concat([df1,df2], axis= 1)

In [ ]:
pd.concat([df1,df2]) # the problem is index number

In [ ]:
pd.concat([df1,df2],ignore_index= True)

In [ ]:
# Video 35 done

In [ ]:
df1 = pd.DataFrame({
    'ID' : [1,2,3,4],
    'Name' : ['A','B','C','D'],
    'Class' : [5,6,7,8]
    })

df1

In [ ]:
df2 = pd.DataFrame({
    'ID' : [3,4],
    'Name' : ['C','D'],
    'Class' : [7,8]
    })

df2

In [ ]:
pd.concat([df1, df2])

In [ ]:
pd.concat([df1, df2], axis= 1)

In [ ]:
pd.concat([df1, df2], axis= 1, join= 'inner') # print only common

In [ ]:
df1

In [ ]:
df2 = pd.DataFrame({
    'ID' : [5,6,7,8],
    'Name' : ['E','F','G','H'],
    'Class' : [9,10,11,12]
    })

df2

In [ ]:
pd.concat([df1, df2], keys= ['df1', 'df2'])

In [ ]:
pd.concat([df1, df2], keys= ['First df', 'Second df'])

In [ ]:
pd.concat([df1, df2], axis= 1, keys= ['First df', 'Second df'])

In [ ]:
df1 = pd.DataFrame({
    'ID' : [1,2,3,4],
    'Name' : ['A','B','C','D'],
    'Class' : [5,6,7,8]
    })

df1

In [ ]:
df2 = pd.DataFrame({'Marks' : [40,63,91,34]})
df2

In [ ]:
pd.concat([df1, df2])

In [ ]:
# vIDEO 36 DONE

In [ ]:
# join() Method
'''
df.join()
Parameters : 
other
on
how
lsuffix
rsuffix
'''

In [183]:
df1 = pd.DataFrame({
    'A' : [1,2,3],
    'B' : [10,20,30]})

df2 = pd.DataFrame({
    'C' : [4,5,6],
    'D' : [40,50,60]})

df1

   A   B
0  1  10
1  2  20
2  3  30

In [ ]:
df2

   C   D
0  4  40
1  5  50
2  6  60

In [ ]:
display(df1,df2) # for display objects

   A   B
0  1  10
1  2  20
2  3  30

   C   D
0  4  40
1  5  50
2  6  60

In [ ]:
df1

   A   B
0  1  10
1  2  20
2  3  30

In [ ]:
df2

   C   D
0  4  40
1  5  50
2  6  60

In [ ]:
df1.join(df2)

   A   B  C   D
0  1  10  4  40
1  2  20  5  50
2  3  30  6  60

In [186]:
df2.join(df1)

   C   D  A   B
0  4  40  1  10
1  5  50  2  20
2  6  60  3  30

In [187]:
df1 = pd.DataFrame({
    'A' : [1,2,3],
    'B' : [10,20,30]},index= ['a','b','c'])

df2 = pd.DataFrame({
    'C' : [4,5,6],
    'D' : [40,50,60]})

display(df1,df2)

   A   B
a  1  10
b  2  20
c  3  30

   C   D
0  4  40
1  5  50
2  6  60

In [188]:
df1.join(df2) # diffarant index

   A   B   C   D
a  1  10 NaN NaN
b  2  20 NaN NaN
c  3  30 NaN NaN

In [189]:
df1 = pd.DataFrame({
    'A' : [1,2,3],
    'B' : [10,20,30]},index= ['a','b','c'])

df2 = pd.DataFrame({
    'C' : [4,5,6],
    'D' : [40,50,60]},index= ['a','b','c'])

display(df1,df2)

   A   B
a  1  10
b  2  20
c  3  30

   C   D
a  4  40
b  5  50
c  6  60

In [190]:
df1.join(df2)

   A   B  C   D
a  1  10  4  40
b  2  20  5  50
c  3  30  6  60

In [191]:
df1 = pd.DataFrame({
    'A' : [1,2,3],
    'B' : [10,20,30]},index= ['a','b','c'])

df2 = pd.DataFrame({
    'C' : [4,5,],
    'D' : [40,50]},index= ['a','b'])

display(df1,df2)

   A   B
a  1  10
b  2  20
c  3  30

   C   D
a  4  40
b  5  50

In [192]:
df1.join(df2) # defolt how = left

   A   B    C     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

In [193]:
df1.join(df2, how = 'right')

   A   B  C   D
a  1  10  4  40
b  2  20  5  50

In [194]:
df1.join(df2, how = 'inner')

   A   B  C   D
a  1  10  4  40
b  2  20  5  50

In [195]:
df1.join(df2, how = 'outer')

   A   B    C     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

In [196]:
df1 = pd.DataFrame({
    'A' : [1,2,3],
    'B' : [10,20,30]},index= ['a','b','c'])

df2 = pd.DataFrame({
    'A' : [4,5,6],
    'D' : [40,50,60]},index= ['a','b','c'])

display(df1,df2)

   A   B
a  1  10
b  2  20
c  3  30

   A   D
a  4  40
b  5  50
c  6  60

In [198]:
# df1.join(df2) # same col name give you error

In [199]:
df1.join(df2, lsuffix= '_1') # change left data frame name

   A_1   B  A   D
a    1  10  4  40
b    2  20  5  50
c    3  30  6  60

In [200]:
df1.join(df2, rsuffix= '_1') # change right data frame name

   A   B  A_1   D
a  1  10    4  40
b  2  20    5  50
c  3  30    6  60

In [202]:
# Vidoe 37 done

In [204]:
# Pandas Append
'''
df.append()
Parameters :
other
ignore_index
sort

'''

'\ndf.append()\nParameters :\nother\nignore_index\nsort\n\n'

In [205]:
df1 = pd.DataFrame({
    'A' : [1,2,3],
    'B' : [10,20,30]})

df2 = pd.DataFrame({
    'A' : [4,5,6],
    'B' : [40,50,60]})

display(df1,df2)

   A   B
0  1  10
1  2  20
2  3  30

   A   B
0  4  40
1  5  50
2  6  60

In [206]:
df1.append(df2)

   A   B
0  1  10
1  2  20
2  3  30
0  4  40
1  5  50
2  6  60

In [207]:
df1.append(df2, ignore_index= True)

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50
5  6  60

In [208]:
df1 = pd.DataFrame({
    'A' : [1,2,3],
    'B' : [10,20,30]})

df2 = pd.DataFrame({
    'c' : [4,5,6],
    'B' : [40,50,60]})

display(df1,df2)

   A   B
0  1  10
1  2  20
2  3  30

   c   B
0  4  40
1  5  50
2  6  60

In [211]:
df1.append(df2, ignore_index= True)

     A   B    c
0  1.0  10  NaN
1  2.0  20  NaN
2  3.0  30  NaN
3  NaN  40  4.0
4  NaN  50  5.0
5  NaN  60  6.0

In [214]:
# vIDEO 38 DONE

In [215]:
# Pandas Pivot Table
# Syntax : DataFrame.pivot_table()
# Parameters : values, index, columns, aggfunc, fill_value, margins, dropna

In [216]:
df = pd.read_csv('Movi_1.csv')
df

       Gener  Year  Budget(M$)  Ratings %
0     Action  2008          28         48
1     Action  2009         200         63
2     Action  2008          32         57
3     Action  2010          20         52
4  Adventure  2009          18         84
5  Adventure  2010         105         44
6     Comedy  2010          20         70
7     Comedy  2008           8         81
8     Comedy  2009          30         71

In [217]:
df.pivot_table(index= 'Gener')

           Budget(M$)  Ratings %     Year
Gener
Action      70.000000         55  2008.75
Adventure   61.500000         64  2009.50
Comedy      19.333333         74  2009.00

In [218]:
df.pivot_table(index= 'Gener', columns = 'Year')

          Budget(M$)               Ratings %
Year            2008   2009   2010      2008  2009  2010
Gener
Action          30.0  200.0   20.0      52.5  63.0  52.0
Adventure        NaN   18.0  105.0       NaN  84.0  44.0
Comedy           8.0   30.0   20.0      81.0  71.0  70.0

In [219]:
df.pivot_table(index= 'Gener', columns = 'Year', aggfunc = 'count') # count how many times it's avable avable

          Budget(M$)           Ratings %
Year            2008 2009 2010      2008 2009 2010
Gener
Action           2.0  1.0  1.0       2.0  1.0  1.0
Adventure        NaN  1.0  1.0       NaN  1.0  1.0
Comedy           1.0  1.0  1.0       1.0  1.0  1.0

In [220]:
df.pivot_table(index= 'Gener', columns = 'Year', aggfunc = 'max')

          Budget(M$)               Ratings %
Year            2008   2009   2010      2008  2009  2010
Gener
Action          32.0  200.0   20.0      57.0  63.0  52.0
Adventure        NaN   18.0  105.0       NaN  84.0  44.0
Comedy           8.0   30.0   20.0      81.0  71.0  70.0

In [221]:
df.pivot_table(index= 'Gener', columns = 'Year', aggfunc = 'sum')

          Budget(M$)               Ratings %
Year            2008   2009   2010      2008  2009  2010
Gener
Action          60.0  200.0   20.0     105.0  63.0  52.0
Adventure        NaN   18.0  105.0       NaN  84.0  44.0
Comedy           8.0   30.0   20.0      81.0  71.0  70.0

In [222]:
df.pivot_table(index= 'Gener', columns = 'Year', fill_value= 'none') # wher is NaN ther will be none

          Budget(M$)               Ratings %
Year            2008   2009   2010      2008  2009  2010
Gener
Action          30.0  200.0   20.0      52.5  63.0  52.0
Adventure       none   18.0  105.0      none  84.0  44.0
Comedy           8.0   30.0   20.0      81.0  71.0  70.0

In [223]:
df.pivot_table(index= 'Gener', columns = 'Year', fill_value= 'none', margins= True) # give avarage valu on the buttom

          Budget(M$)                                  Ratings %             \
Year            2008       2009       2010        All      2008       2009
Gener
Action          30.0      200.0       20.0       70.0      52.5       63.0
Adventure       none       18.0      105.0       61.5      none       84.0
Comedy           8.0       30.0       20.0  19.333333      81.0       71.0
All        22.666667  82.666667  48.333333  51.222222      62.0  72.666667


Year            2010        All
Gener
Action          52.0       55.0
Adventure       44.0       64.0
Comedy          70.0       74.0
All        55.333333  63.333333

In [224]:
df.pivot_table(index= 'Gener', columns = 'Year', aggfunc= 'sum', fill_value= 'none', margins= True)

          Budget(M$)                    Ratings %
Year            2008   2009   2010  All      2008  2009  2010  All
Gener
Action          60.0  200.0   20.0  280     105.0  63.0  52.0  220
Adventure       none   18.0  105.0  123      none  84.0  44.0  128
Comedy           8.0   30.0   20.0   58      81.0  71.0  70.0  222
All               68    248    145  461       186   218   166  570

In [226]:
# vIDEO 39 DONE

In [227]:
# Pandas Melt Function
# Syntax : pandas.melt()
# Parameters : frame, id_vars, valu_vars, var_name, valu_name

In [229]:
df = pd.read_csv('Movi_1.csv')
df

       Gener  Year  Budget(M$)  Ratings %
0     Action  2008          28         48
1     Action  2009         200         63
2     Action  2008          32         57
3     Action  2010          20         52
4  Adventure  2009          18         84
5  Adventure  2010         105         44
6     Comedy  2010          20         70
7     Comedy  2008           8         81
8     Comedy  2009          30         71

In [230]:
pd.melt(df)

      variable      value
0        Gener     Action
1        Gener     Action
2        Gener     Action
3        Gener     Action
4        Gener  Adventure
5        Gener  Adventure
6        Gener     Comedy
7        Gener     Comedy
8        Gener     Comedy
9         Year       2008
10        Year       2009
11        Year       2008
12        Year       2010
13        Year       2009
14        Year       2010
15        Year       2010
16        Year       2008
17        Year       2009
18  Budget(M$)         28
19  Budget(M$)        200
20  Budget(M$)         32
21  Budget(M$)         20
22  Budget(M$)         18
23  Budget(M$)        105
24  Budget(M$)         20
25  Budget(M$)          8
26  Budget(M$)         30
27   Ratings %         48
28   Ratings %         63
29   Ratings %         57
30   Ratings %         52
31   Ratings %         84
32   Ratings %         44
33   Ratings %         70
34   Ratings %         81
35   Ratings %         71

In [231]:
pd.melt(df, id_vars= ['Gener'])

        Gener    variable  value
0      Action        Year   2008
1      Action        Year   2009
2      Action        Year   2008
3      Action        Year   2010
4   Adventure        Year   2009
5   Adventure        Year   2010
6      Comedy        Year   2010
7      Comedy        Year   2008
8      Comedy        Year   2009
9      Action  Budget(M$)     28
10     Action  Budget(M$)    200
11     Action  Budget(M$)     32
12     Action  Budget(M$)     20
13  Adventure  Budget(M$)     18
14  Adventure  Budget(M$)    105
15     Comedy  Budget(M$)     20
16     Comedy  Budget(M$)      8
17     Comedy  Budget(M$)     30
18     Action   Ratings %     48
19     Action   Ratings %     63
20     Action   Ratings %     57
21     Action   Ratings %     52
22  Adventure   Ratings %     84
23  Adventure   Ratings %     44
24     Comedy   Ratings %     70
25     Comedy   Ratings %     81
26     Comedy   Ratings %     71

In [232]:
pd.melt(df, id_vars= ['Year'])

    Year    variable      value
0   2008       Gener     Action
1   2009       Gener     Action
2   2008       Gener     Action
3   2010       Gener     Action
4   2009       Gener  Adventure
5   2010       Gener  Adventure
6   2010       Gener     Comedy
7   2008       Gener     Comedy
8   2009       Gener     Comedy
9   2008  Budget(M$)         28
10  2009  Budget(M$)        200
11  2008  Budget(M$)         32
12  2010  Budget(M$)         20
13  2009  Budget(M$)         18
14  2010  Budget(M$)        105
15  2010  Budget(M$)         20
16  2008  Budget(M$)          8
17  2009  Budget(M$)         30
18  2008   Ratings %         48
19  2009   Ratings %         63
20  2008   Ratings %         57
21  2010   Ratings %         52
22  2009   Ratings %         84
23  2010   Ratings %         44
24  2010   Ratings %         70
25  2008   Ratings %         81
26  2009   Ratings %         71

In [233]:
pd.melt(df, id_vars= ['Year'], value_vars= ['Gener'])

   Year variable      value
0  2008    Gener     Action
1  2009    Gener     Action
2  2008    Gener     Action
3  2010    Gener     Action
4  2009    Gener  Adventure
5  2010    Gener  Adventure
6  2010    Gener     Comedy
7  2008    Gener     Comedy
8  2009    Gener     Comedy

In [234]:
pd.melt(df, id_vars= ['Year'], value_vars= ['Ratings %'])

   Year   variable  value
0  2008  Ratings %     48
1  2009  Ratings %     63
2  2008  Ratings %     57
3  2010  Ratings %     52
4  2009  Ratings %     84
5  2010  Ratings %     44
6  2010  Ratings %     70
7  2008  Ratings %     81
8  2009  Ratings %     71

In [235]:
pd.melt(df, id_vars= ['Year'], value_vars= ['Ratings %'], var_name= 'Category')

   Year   Category  value
0  2008  Ratings %     48
1  2009  Ratings %     63
2  2008  Ratings %     57
3  2010  Ratings %     52
4  2009  Ratings %     84
5  2010  Ratings %     44
6  2010  Ratings %     70
7  2008  Ratings %     81
8  2009  Ratings %     71

In [236]:
pd.melt(df, id_vars= ['Year'], value_vars= ['Ratings %'], var_name= 'Category', value_name= 'Data')

   Year   Category  Data
0  2008  Ratings %    48
1  2009  Ratings %    63
2  2008  Ratings %    57
3  2010  Ratings %    52
4  2009  Ratings %    84
5  2010  Ratings %    44
6  2010  Ratings %    70
7  2008  Ratings %    81
8  2009  Ratings %    71

In [238]:
# Video 40 Done

In [239]:
# DatetimeIndex

In [244]:
df = pd.read_csv('Student_2.csv')
df

,Date,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1/7/2019,10,2.0,9.0,3,5,50.0
1,2/7/2019,10,6.0,NaN,4,0,NaN
2,3/7/2019,10,3.0,8.0,4,4,NaN
3,4/7/2019,11,NaN,10.0,1,5,NaN
4,5/7/2019,11,4.0,7.0,2,0,75.0
5,6/7/2019,11,NaN,7.0,0,0,96.0
6,7/7/2019,12,4.0,NaN,0,0,80.0
7,8/7/2019,12,10.0,6.0,2,0,90.0
8,9/7/2019,12,2.0,8.0,2,4,60.0
9,10/7/2019,12,6.0,9.0,1,0,85.0

In [245]:
df.dtypes

Date             object
Class             int64
Study hrs       float64
Sleeping hrs    float64
Social Media      int64
Mobile Game       int64
Percantege      float64
dtype: object

In [246]:
type(df.Date[0])

str

In [247]:
df = pd.read_csv('Student_2.csv', parse_dates= ['Date'])
df

,Date,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,2019-01-07,10,2.0,9.0,3,5,50.0
1,2019-02-07,10,6.0,NaN,4,0,NaN
2,2019-03-07,10,3.0,8.0,4,4,NaN
3,2019-04-07,11,NaN,10.0,1,5,NaN
4,2019-05-07,11,4.0,7.0,2,0,75.0
5,2019-06-07,11,NaN,7.0,0,0,96.0
6,2019-07-07,12,4.0,NaN,0,0,80.0
7,2019-08-07,12,10.0,6.0,2,0,90.0
8,2019-09-07,12,2.0,8.0,2,4,60.0
9,2019-10-07,12,6.0,9.0,1,0,85.0

In [249]:
df.dtypes

Date            datetime64[ns]
Class                    int64
Study hrs              float64
Sleeping hrs           float64
Social Media             int64
Mobile Game              int64
Percantege             float64
dtype: object

In [248]:
type(df.Date[0])

pandas._libs.tslibs.timestamps.Timestamp

In [ ]:
# Pandas Done